[
  {
    "name": "Dato Sri Ho Kam Choy",
    "position": "Chairman of the Board & Chief Executive Officer ",
    "description": "Dato’ Sri Kam Choy Ho is the Chairman of our Board and Chief Executive Officer and joined our Group since its inception. He is primarily responsible for the overall strategic planning, business development and management of our Group. He has over 35 years of experience in the commercial management of vessels in the shipping industry. Apart from our Group, he has been a director of R.H. Pacific Shipping (Agencies) Limited (previously known as Hotama Pacific Shipping (Agencies) Limited) since August 1997, a company that primarily engages in shipping and transportation of bulk/bagged cargo, and he is responsible for supervising the business operation and general management. He joined Straits in August 2016 as a non-independent and non-executive director and was re-designated as an executive director in January 2017. He is currently the group managing director of Straits Energy Resources Berhad, and is responsible for the overall business management and strategic development.",
    "image": "/images/bod/image-3.png"
    
  },
  {
    "name": "Dato' Leong Yan Yoong",
    "position": "Executive Director ",
    "description": "Dato’ Leong Yan Yoong is our Executive Director. He is primarily responsible for the corporate affairs, advising on corporate strategies, policies and other general matters of our Group. Prior to joining our Group, he was the marketing officer of Arab Malaysian Credit Berhad from June 1986 to September 1988, and was responsible for the business development of the leasing division. From October 1988 to November 1989, he was a dealer with Arab Malaysian Merchant Bank Bhd attached to the money division. From 1992 to 2000, he was attached to several financial institutions such as Chung Khiaw Bank Ltd, British American Insurance Limited and a few broking houses, dealing in corporate loans, investments, properties and equity market. From June 2001 to June 2017, he was employed by CIMB Investment Bank Berhad, with his last position as Senior Vice President. He joined Straits in July 2017 as the Corporate Advisor and has been an executive director of Straits since August 2022. He is primarily responsible for advising and handling all matters related to Straits Group’s corporate affairs, mergers and acquisitions, restructuring, fund raising, corporate planning/strategies and special projects. Dato’ Yoong has been a Chartered Accountant of the Chartered Institute of Management Accountants, United Kingdom (“CIMA”) since May 1986. He was admitted as an Associate Member of the CIMA in December 1993 and designated as a Chartered Global Management Accountant in October 2021. He was admitted as a Chartered Accountant and a member of the Malaysian Institute of Accountants (“MIA”) in December 2021. Dato’ Yoong has been a Chartered Accountant of the Chartered Institute of Management Accountants, United Kingdom (“CIMA”) since May 1986. He was admitted as an Associate Member of the CIMA in December 1993 and designated as a Chartered Global Management Accountant in October 2021. He was admitted as a Chartered Accountant and a member of the Malaysian Institute of Accountants (“MIA”) in December 2021.",
     "image": "/images/bod/image-6.png"
  },
  {
    "name": "Datin Fong Shiang Ng",
    "position": "Independent Director & Chairlady of Audit Committee",
    "description": "Datin Fong Shiang Ng is our Independent Director. She is the Chairlady of Audit Committee, and a member of the Compensation Committee and Nominating and Corporate Governance Committee. Datin Fong Shiang Ng has over 22 years of experience in finance, accounting, internal controls, corporate finance and governance. Prior to joining our Group, she was employed by Hong Leong Bank Berhad from June 2002 to April 2009 with her last position as the branch manager of the Shah Alam branch. She was responsible for overseeing the daily operations and sales of the Shah Alam branch. From April 2009 to January 2011, she was the Section Head of the Transformation Office of RHB Capital Berhad, and was responsible for projects management and merger and acquisitions of the group. From February 2011 to August 2014, she was employed by RHB Bank Berhad with her last position as Section Head, Distribution Business Banking Group. From September 2014 to November 2016, she was a financial consultant, and she was responsible for providing financial advisory services to companies in the construction and property development industry. Since December 2016 to November 2022, she has been the chief financial officer of Perfect Channel Sdn. Bhd., a steel manufacturing company, at which she was responsible for the overall financial management of the company. She has been an independent non-executive director of Straits since August 2022. She was appointed as executive director of PTT Synergy Group Berhad since May 2023, a listed company registered in Main Market of Bursa Malaysia, being one of the leading construction companies specialized in Earthwork & Infrastructure Works. The group has expanded into property development, primarily focuses on industrial warehouse and total intralogistics solutions. Datin Fong Shiang Ng received a bachelor's degree in economics from the University Sains Malaysia, Penang in 2002.",
     "image": "/images/bod/image-2.png"
  },
  {
    "name": "Mr. Kok Chaw Leong",
    "position": "Independent Director & Chairman of Compensation Committee",
    "description": "Mr. Kok Chaw Leong is our Independent Director. He is the Chairman of Compensation Committee, and a member of Audit Committee and Nominating and Corporate Governance Committee. Mr. Leong has over 27 years of experience in the banking industry whom he started his career with Malayan Banking Berhad in 1983. He is specializing in government contract financing & international trade financing. Prior to joining our Group, he was employed by Affin Bank Berhad from 1989 to 2007 with his last position as senior manager of the Small and Medium Enterprise (“SME”) Department. He was responsible for marketing of new clients, helping clients with their financial and investment planning, achieving sales targets and ensuring excellence in bank-clients relationship. From 2007 to 2009, he served as the senior relationship manager with Ambank Berhad, and responsible for providing financial advices to the emerging corporate clients on their financial needs and assisting them in restructuring existing banking facilities. From 2009 to 2020, he set up and managing an international logistics company which is primarily engaged in providing the one stop logistics solutions, including forwarding, custom clearance, warehousing and distribution to his local clients and international clients from China and Korea. Since January 2023, he has been an independent director of Straits. Mr. Leong has been a Certified Credit Professional of the Institute Bank-Bank Malaysia in 2003.",
     "image": "/images/bod/image-1.png"
  },
  {
    "name": "Mr. Yick Fabian Shin",
    "position": "Independent Director & Chairman of Nominating and Corporate Governance Committee",
    "description": "Mr. Yick Fabian Shin is our Independent Director. He is the Chairman of Nominating and Corporate Governance Committee, and a member of  the Audit Committee and Compensation Committee. Mr. Shin has over 26 years of experience in investment banking and financial management. Prior to joining our Group, he worked in the audit department of Deloitte Touche Tohmatsu from August 1991 to February 1994. From November 1999 to July 2015, he worked in various investment banks including as the Deputy Chief Executive Officer of CMB International Capital Corporation Limited. He was an independent non-executive director of China Tianrui Automotive Interiors Co., Ltd. from December 2018 to September 2020 and a non-executive director of Pak Tak International Limited (stock code: 6162) from February 2017 to February 2023 (stock code: 2668), all of which are listed on The Stock Exchange of Hong Kong Limited (the “Hong Kong Stock Exchange”). He also served as an independent director of Bio Key International, Inc., a company listed on Nasdaq Capital Market (symbol: BKYI) from November 2017 to September 2020. Mr. Shin has also been an independent non-executive directors of Lisi Group Holdings Limited (stock code: 526) since January 2013, Newton Resources Ltd (stock code: 1231) since August 2015 and Zhengye International Holdings Company Limited (stock code: 3363) since May 2019, all of which are listed on the Hong Kong Stock Exchange.Mr. Shin graduated from the University of Birmingham in England with a bachelor’s degree in commerce in July 1990. He was admitted as a fellow of The Association of Chartered Certified Accountants in March 2000. ",
     "image": "/images/bod/image-4.png"
  }
]

