[
    {
      "name": "Dato' Sri Kam Choy Ho",
      "position": "Chief Executive Director",
      "description": "Dato’ Sri Kam Choy Ho, aged 61, is the chairman of our Board and Chief Executive Officer and joined our Group since its inception. He is primarily responsible for the overall strategic planning, business development and management of our Group. He has over 35 years of experience in the commercial management of vessels in the shipping industry. Apart from our Group, he has been a director of R.H. Pacific Shipping (Agencies) Limited (previously known as Hotama Pacific Shipping (Agencies) Limited) since August 1997, a company that primarily engages in shipping and transportation of bulk/bagged cargo, and he is responsible for supervising the business operation and general management. He joined Straits in August 2016 as a non-independent and non-executive director and was re-designated as an executive director in January 2017. He is currently the group managing director of Straits, and is responsible for the overall business management and strategic development.",
      "image": "/images/bod/image-3.png"
    },
    {
      "name": "Dato' Leong Yan, Yoong",
      "position": "Executive Director",
      "description": "Dato’ Leong Yan Yoong, aged 63, will immediately be appointed as our Executive Director upon the effectiveness of our registration statement on Form F-1, of which this prospectus is a part, and he is primarily responsible for the corporate affairs, advising on corporate strategies, policies and other general matters of our Group. Prior to joining our Group, he was the marketing officer of Arab Malaysian Credit Berhad from June 1986 to September 1988, and was responsible for the business development of the leasing division. From October 1988 to November 1989, he was a dealer with Arab Malaysian Merchant Bank Bhd attached to the money division. From 1992 to 2000, he was attached to several financial institutions such as Chung Khiaw Bank Ltd, British American Insurance Limited and a few broking houses, dealing in corporate loans, investments, properties and equity market. From June 2001 to June 2017, he was employed by CIMB Investment Bank Berhad, with his last position as Senior Vice President. He joined Straits in July 2017 as the Corporate Advisor and has been an Executive Director of Straits since August 2022. He is primarily responsible for advising and handling all matters related to Straits Group’s corporate affairs, mergers and acquisitions, restructuring, fund raising, corporate planning/strategies and special projects.",
      "image": "/images/bod/image.png"
    },
    {
      "name": "Mr Chee Mun Hoh",
      "position": "Chief Financial Officer",
      "description": "Mr. Chee Mun Hoh, aged 59, is the chief financial officer of our Company. He is responsible for formulating corporate strategies, overall management of financial, merger and acquisitions and capital market affairs of our Group. Mr. Hoh has over 38 years of experience in finance, accounting, internal controls and corporate governance. Prior to joining our Group, he was an article clerk of BDO Binder from May 1985 to December 1989. From January 1990 to April 1995, he was employed by Ernst & Young with his last position as audit senior. From May 1996 to August 2004, he was the group accountant of Fella Group, a regional furniture manufacturer cum retailer, where he was responsible for overseeing the accounts, finance, internal audit, human resources and information technology. From March 2005 to August 2012, he served as the Finance Director of VHQ Post (M) Sdn. Bhd, a provider of media production services which is headquartered in Singapore, where he was responsible for overseeing the accounts, finance and corporate secretarial matters in Malaysia, Singapore, Indonesia, Thailand, Vietnam and China. From August 2012 to February 2017, he provided general management consultancy and Goods and Services Tax services in Malaysia. From May 2015 to May 2024, he served as an independent non-executive director of QES Group Berhad, a leading integrated solution provider specialized in manufacturing, distribution and provision of engineering services for inspection, test, measuring, analytical and automated handling equipment in Malaysia which is listed on the Main Market of Bursa Malaysia (stock code: 0196). During his tenure in QES Group Berhad, he was the chairman of its audit committee until June 2022 before he became the chairman of its remuneration committee until May 2024. He joined Straits as a financial controller in April 2017 and has been promoted to the Group Chief Financial Officer cum General Manager of Straits in July 2022. He is responsible for the overall financial management of the company.",
      "image": "/images/bod/image-4.png"
    }
  ]